"use strict";

// Пусть дан объект:
let obj = {
	'ru': ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'], 
	'en': ['mn', 'ts', 'wd', 'th', 'fr', 'st', 'sn'], 
};

// Выведем элемент 'чт'
console.log(obj['ru'][3]);

// Пусть теперь данные о языке и номере дня хранятся в переменной
let lang = 'ru';
let day = 2;

// Выведем с помощью наших переменных день недели
console.log(obj[lang][day]); // Выведет 'ср'

// Задача 1
let months = {
	'ru': [
		'январь',
		'февраль',
		'март',
		'апрель',
		'май',
		'июнь',
		'июль',
		'август',
		'сентябрь',
		'октябрь',
		'ноябрь',
		'декабрь',
	],
	'en': [
		'january',
		'february',
		'march',
		'april',
		'may',
		'june',
		'july',
		'august',
		'september',
		'october',
		'november',
		'december',
	],
};
lang = 'ru'; // может быть или 'ru' или 'en'
let month = 5;   // число от 0 до 11
// Вывести название месяца
console.log(months[lang][month]);

// Задача 2
let affairs = {
	'2018': {
		11: {
			29: ['дело111', 'дело112', 'дело113'],
			30: ['дело121', 'дело122', 'дело123'],
		},
		12: {
			30: ['дело211', 'дело212', 'дело213'],
			31: ['дело221', 'дело222', 'дело223'],
		},
	},
	'2019': {
		12: {
			29: ['дело311', 'дело312', 'дело313'],
			30: ['дело321', 'дело322', 'дело323'],
			31: ['дело331', 'дело332', 'дело333'],
		}
	},
}
let year = 2019;
month = 12;
day = 30;
console.log(affairs[year][month][day]);

// Подводный камень с ключами объекта
obj = {
	'ru': ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 
		'вс'], 
	'en': ['mn', 'ts', 'wd', 'th', 'fr', 'st', 
		'sn'], 
};
lang = 'ru';
day = 3;
console.log(obj[lang][day]);
// Частые ошибки
// Ошибка 1 - имена переменных не следует брать в кавычки
// console.log(obj['lang']['day']); // ТАК НЕПРАВИЛЬНО

// Ошибка 2 - имена переменных нельзя записывать, как свойства объекта
// console.log(obj.lang[day]); // ТАК НЕПРАВИЛЬНО

// Задача 3
// Автор следующего кода хотел вывести элемент со значением '24'
obj = {
	key1: {
		key2: '12',
		key3: '13',
	},
	key2: {
		key4: '24',
		key5: '25',
	},
}
let key1 = 'key2';
let key2 = 'key4';
console.log(obj[key1][key2]);

// Задача 4
obj = {
	key1: {
		key2: '12',
		key3: '13',
	},
	key2: {
		key4: '24',
		key5: '25',
	},
}
key1 = 'key2';
key2 = 'key4';
console.log(obj[key1][key2]);


// Задача 5
obj = {
	key1: {
		key2: '12',
		key3: '13',
	},
	key2: {
		key4: '24',
		key5: '25',
	},
}
key1 = 'key2';
key2 = 'key4';
console.log(obj[key1][key2]);

// Задача 6
obj = {
	key1: {
		key2: '12',
		key3: '13',
	},
	key2: {
		key4: '24',
		key5: '25',
	},
}

key1 = 'key2';
console.log(obj[key1]['key4']);